; ModuleID = 'demo.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [17 x i8] c"@@ start FuncA\0D\0A\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"test-%u\00", align 1
@.str.2 = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"value = %u \0D\0A\00", align 1
@.str.4 = private unnamed_addr constant [15 x i8] c"@@ end FuncA\0D\0A\00", align 1
@.str.5 = private unnamed_addr constant [17 x i8] c"@@ start FuncB\0D\0A\00", align 1
@.str.6 = private unnamed_addr constant [15 x i8] c"@@ end FuncB\0D\0A\00", align 1
@.str.7 = private unnamed_addr constant [16 x i8] c"@@ start main\0D\0A\00", align 1
@.str.8 = private unnamed_addr constant [14 x i8] c"@@ end main\0D\0A\00", align 1
@.str.9 = private unnamed_addr constant [16 x i8] c"@@ Value = %u\0D\0A\00", align 1
@.str.10 = private unnamed_addr constant [21 x i8] c"@@ start Getpasswd\0D\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "source/main.c", directory: "/home/cs6890/CS5890-6890-Program-Analysis/pa_template/benchmark/bench1", checksumkind: CSK_MD5, checksum: "65035faacb3cd875471b956cc13ca609")
!2 = !{!3}
!3 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!4 = distinct !DICompileUnit(language: DW_LANG_C99, file: !5, producer: "clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!5 = !DIFile(filename: "source/Passwd.c", directory: "/home/cs6890/CS5890-6890-Program-Analysis/pa_template/benchmark/bench1", checksumkind: CSK_MD5, checksum: "d1964cb69b9bbc9f0eca6373886e2e72")
!6 = !{!"clang version 14.0.6"}
!7 = !{i32 7, !"Dwarf Version", i32 5}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 1, !"wchar_size", i32 4}
!10 = !{i32 7, !"uwtable", i32 1}
!11 = !{i32 7, !"frame-pointer", i32 2}
!12 = distinct !DISubprogram(name: "FuncA", scope: !1, file: !1, line: 6, type: !13, scopeLine: 7, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !18)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15, !17}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!18 = !{}
!19 = !DILocalVariable(name: "SEED", arg: 1, scope: !12, file: !1, line: 6, type: !15)
!20 = !DILocation(line: 6, column: 18, scope: !12)
!21 = !DILocalVariable(name: "Index", arg: 2, scope: !12, file: !1, line: 6, type: !17)
!22 = !DILocation(line: 6, column: 33, scope: !12)
!23 = !DILocation(line: 8, column: 5, scope: !12)
!24 = !DILocation(line: 9, column: 14, scope: !12)
!25 = !DILocation(line: 9, column: 31, scope: !12)
!26 = !DILocation(line: 9, column: 5, scope: !12)
!27 = !DILocalVariable(name: "F", scope: !12, file: !1, line: 11, type: !28)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !30, line: 7, baseType: !31)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!31 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !32, line: 49, size: 1728, elements: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !49, !51, !52, !53, !57, !59, !61, !65, !68, !70, !73, !76, !77, !79, !83, !84}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !31, file: !32, line: 51, baseType: !17, size: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !31, file: !32, line: 54, baseType: !15, size: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !31, file: !32, line: 55, baseType: !15, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !31, file: !32, line: 56, baseType: !15, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !31, file: !32, line: 57, baseType: !15, size: 64, offset: 256)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !31, file: !32, line: 58, baseType: !15, size: 64, offset: 320)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !31, file: !32, line: 59, baseType: !15, size: 64, offset: 384)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !31, file: !32, line: 60, baseType: !15, size: 64, offset: 448)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !31, file: !32, line: 61, baseType: !15, size: 64, offset: 512)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !31, file: !32, line: 64, baseType: !15, size: 64, offset: 576)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !31, file: !32, line: 65, baseType: !15, size: 64, offset: 640)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !31, file: !32, line: 66, baseType: !15, size: 64, offset: 704)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !31, file: !32, line: 68, baseType: !47, size: 64, offset: 768)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !32, line: 36, flags: DIFlagFwdDecl)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !31, file: !32, line: 70, baseType: !50, size: 64, offset: 832)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !31, file: !32, line: 72, baseType: !17, size: 32, offset: 896)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !31, file: !32, line: 73, baseType: !17, size: 32, offset: 928)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !31, file: !32, line: 74, baseType: !54, size: 64, offset: 960)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !55, line: 152, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!56 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !31, file: !32, line: 77, baseType: !58, size: 16, offset: 1024)
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !31, file: !32, line: 78, baseType: !60, size: 8, offset: 1040)
!60 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !31, file: !32, line: 79, baseType: !62, size: 8, offset: 1048)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 8, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 1)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !31, file: !32, line: 81, baseType: !66, size: 64, offset: 1088)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !32, line: 43, baseType: null)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !31, file: !32, line: 89, baseType: !69, size: 64, offset: 1152)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !55, line: 153, baseType: !56)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !31, file: !32, line: 91, baseType: !71, size: 64, offset: 1216)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !32, line: 37, flags: DIFlagFwdDecl)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !31, file: !32, line: 92, baseType: !74, size: 64, offset: 1280)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !32, line: 38, flags: DIFlagFwdDecl)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !31, file: !32, line: 93, baseType: !50, size: 64, offset: 1344)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !31, file: !32, line: 94, baseType: !78, size: 64, offset: 1408)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !31, file: !32, line: 95, baseType: !80, size: 64, offset: 1472)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !81, line: 46, baseType: !82)
!81 = !DIFile(filename: "tools/build/lib/clang/14.0.6/include/stddef.h", directory: "/home/cs6890", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!82 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !31, file: !32, line: 96, baseType: !17, size: 32, offset: 1536)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !31, file: !32, line: 98, baseType: !85, size: 160, offset: 1568)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 20)
!88 = !DILocation(line: 11, column: 11, scope: !12)
!89 = !DILocation(line: 11, column: 22, scope: !12)
!90 = !DILocation(line: 11, column: 15, scope: !12)
!91 = !DILocalVariable(name: "value", scope: !12, file: !1, line: 12, type: !3)
!92 = !DILocation(line: 12, column: 14, scope: !12)
!93 = !DILocation(line: 12, column: 32, scope: !12)
!94 = !DILocation(line: 12, column: 22, scope: !12)
!95 = !DILocation(line: 12, column: 41, scope: !12)
!96 = !DILocation(line: 13, column: 32, scope: !12)
!97 = !DILocation(line: 13, column: 5, scope: !12)
!98 = !DILocation(line: 14, column: 13, scope: !12)
!99 = !DILocation(line: 14, column: 43, scope: !12)
!100 = !DILocation(line: 14, column: 5, scope: !12)
!101 = !DILocation(line: 15, column: 12, scope: !12)
!102 = !DILocation(line: 15, column: 5, scope: !12)
!103 = !DILocation(line: 16, column: 5, scope: !12)
!104 = !DILocation(line: 17, column: 1, scope: !12)
!105 = distinct !DISubprogram(name: "FuncB", scope: !1, file: !1, line: 20, type: !106, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !18)
!106 = !DISubroutineType(types: !107)
!107 = !{!3, !108}
!108 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !DILocalVariable(name: "Value", arg: 1, scope: !105, file: !1, line: 20, type: !108)
!110 = !DILocation(line: 20, column: 31, scope: !105)
!111 = !DILocation(line: 22, column: 5, scope: !105)
!112 = !DILocalVariable(name: "Pwd", scope: !105, file: !1, line: 23, type: !3)
!113 = !DILocation(line: 23, column: 14, scope: !105)
!114 = !DILocalVariable(name: "FValue", scope: !105, file: !1, line: 25, type: !3)
!115 = !DILocation(line: 25, column: 14, scope: !105)
!116 = !DILocation(line: 25, column: 23, scope: !105)
!117 = !DILocation(line: 25, column: 30, scope: !105)
!118 = !DILocation(line: 25, column: 29, scope: !105)
!119 = !DILocation(line: 25, column: 40, scope: !105)
!120 = !DILocation(line: 25, column: 39, scope: !105)
!121 = !DILocation(line: 25, column: 36, scope: !105)
!122 = !DILocation(line: 25, column: 46, scope: !105)
!123 = !DILocation(line: 26, column: 13, scope: !105)
!124 = !DILocation(line: 26, column: 5, scope: !105)
!125 = !DILocation(line: 30, column: 17, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !1, line: 29, column: 9)
!127 = distinct !DILexicalBlock(scope: !105, file: !1, line: 27, column: 5)
!128 = !DILocation(line: 31, column: 13, scope: !126)
!129 = !DILocation(line: 35, column: 17, scope: !130)
!130 = distinct !DILexicalBlock(scope: !127, file: !1, line: 34, column: 9)
!131 = !DILocation(line: 36, column: 13, scope: !130)
!132 = !DILocation(line: 40, column: 19, scope: !133)
!133 = distinct !DILexicalBlock(scope: !127, file: !1, line: 39, column: 9)
!134 = !DILocation(line: 40, column: 17, scope: !133)
!135 = !DILocation(line: 41, column: 13, scope: !133)
!136 = !DILocation(line: 45, column: 19, scope: !137)
!137 = distinct !DILexicalBlock(scope: !127, file: !1, line: 44, column: 9)
!138 = !DILocation(line: 45, column: 17, scope: !137)
!139 = !DILocation(line: 46, column: 13, scope: !137)
!140 = !DILocation(line: 47, column: 13, scope: !137)
!141 = !DILocation(line: 50, column: 5, scope: !105)
!142 = !DILocation(line: 51, column: 12, scope: !105)
!143 = !DILocation(line: 51, column: 5, scope: !105)
!144 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 55, type: !145, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !18)
!145 = !DISubroutineType(types: !146)
!146 = !{!17, !17, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!148 = !DILocalVariable(name: "argc", arg: 1, scope: !144, file: !1, line: 55, type: !17)
